Revit 2026 API

# UVDotProduct Method

---

The dot product of this 2-D vector and the specified 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DotProduct(
	UV source
)
```
```vb
Public Function DotProduct (
	source As UV
) As Double
```
```cpp
public:
double DotProduct(
	UV^ source
)
```
```fsharp
member DotProduct :
        source : UV -> float
```

#### Parameters

source UV
    The vector to multiply with this vector.

#### Return Value

DoubleThe real number equal to the dot product.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The dot product is the sum of the respective coordinates of the two vectors: Pu * Ru + Pv * Rv.

#### Reference

UV Class

Autodesk.Revit.DB Namespace